# Категории для плитки
tile_categories = {
    # Категория "Назначение" для плитки
    'Назначение плитки': {
        'options': {
            'Для ванной': '&arrFilter_45_2367533627=Y',
            'Керамогранит': '&arrFilter_45_2225864208=Y',
            'Мозаика': '&arrFilter_45_336913281=Y',
            'Настенная плитка': '&arrFilter_45_326707096=Y',
            'Напольная плитка': '&arrFilter_45_1662243607=Y',
            'Для кухни': '&arrFilter_45_4196041389=Y',
            'Ступени (клинкер)': '&arrFilter_45_4088188550=Y'
        },
        'text': 'Выберите назначение плитки:',
        'next_step': 'Цвет плитки'
    },
    # Категория "Цвет" для плитки
    'Цвет плитки': {
        'options': {
            'Белый': '&arrFilter_44_734540143=Y',
            'Бежевый': '&arrFilter_44_1557070329=Y',
            'Желтый': '&arrFilter_44_1161005205=Y',
            'Голубой': '&arrFilter_44_895056922=Y',
            'Красный': '&arrFilter_44_3694844207=Y',
            'Розовый': '&arrFilter_44_842315779=Y',
            'Зеленый': '&arrFilter_44_1113476236=Y',
            'Коричневый': '&arrFilter_44_3429899368=Y',
            'Мультиколор': '&arrFilter_44_3795085693=Y',
            'Оранжевый': '&arrFilter_44_3145149694=Y',
            'Серый': '&arrFilter_44_3679919414=Y',
            'Синий': '&arrFilter_44_2890935712=Y',
            'Фиолетовый': '&arrFilter_44_2872961465=Y',
            'Черно-белый': '&arrFilter_44_2651089905=Y',
            'Черный': '&arrFilter_44_1273495719=Y',
        },
        'text': 'Выберите цвет плитки:',
        'next_step': 'Поверхность плитки'  # Переход к следующему шагу - выбор поверхности
    },
    # Добавление "Поверхность" для плитки
    'Поверхность плитки': {
        'options': {
            '3D - объемная': '&arrFilter_46_1124766700=Y',
            'Глянцевая': '&arrFilter_46_2999017685=Y',
            'Лаппатированная': '&arrFilter_46_136430004=Y',
            'Матовая': '&arrFilter_46_3318108227=Y',
            'Металлизированная': '&arrFilter_46_2041144555=Y',
            'Полированная': '&arrFilter_46_600644105=Y',
            'Противоскользящая': '&arrFilter_46_256640429=Y',
            'Рельефная': '&arrFilter_46_1022308401=Y',
            'Сатинированная': '&arrFilter_46_2865420758=Y'
        },
        'text': 'Выберите поверхность плитки:',
        'next_step': 'Рисунок плитки'
    },
    # Добавление "Рисунок" для плитки

    'Рисунок плитки': {
        'options': {
            'Ёлочка': '&arrFilter_303_2466923154=Y',
            'Абстракция': '&arrFilter_303_777373087=Y',
            'Бабочка': '&arrFilter_303_1319056662=Y',
            'Брусчатка': '&arrFilter_303_2030862416=Y',
            'В клетку': '&arrFilter_303_1422535327=Y',
            'В полоску': '&arrFilter_303_1568433844=Y',
            'Волны': '&arrFilter_303_3133262972=Y',
            'Геометрия': '&arrFilter_303_687500209=Y',
            'Дизайн': '&arrFilter_303_163811428=Y',
            'Зеркальный': '&arrFilter_303_3522607083=Y',
            'Кракелюр': '&arrFilter_303_3826086404=Y',
            'Лофт': '&arrFilter_303_896538121=Y',
            'Металл': '&arrFilter_303_2544305607=Y',
            'Метлахский': '&arrFilter_303_2800846717=Y',
            'Моноколор': '&arrFilter_303_756453947=Y',
            'Мрамор': '&arrFilter_303_1742705075=Y',
            'Однотонная': '&arrFilter_303_313873987=Y',
            'Оригами': '&arrFilter_303_2693878842=Y',
            'Орнамент': '&arrFilter_303_1498608905=Y',
            'Под бетон': '&arrFilter_303_2902782656=Y',
            'Под гальку': '&arrFilter_303_167973672=Y',
            'Под гранит': '&arrFilter_303_4252118912=Y',
            'Под дерево': '&arrFilter_303_3010594712=Y',
            'Под камень': '&arrFilter_303_3021980545=Y',
            'Под кирпич': '&arrFilter_303_1147623413=Y',
            'Под ковер': '&arrFilter_303_1877632834=Y',
            'Под кожу': '&arrFilter_303_2435354638=Y',
            'Под ламинат': '&arrFilter_303_1445556349=Y',
            'Под металл': '&arrFilter_303_2757035718=Y',
            'Под мозаику': '&arrFilter_303_1511105197=Y',
            'Под мрамор': '&arrFilter_303_1139616705=Y',
            'Под обои': '&arrFilter_303_2917354221=Y',
            'Под оникс': '&arrFilter_303_2380059838=Y',
            'Под паркет': '&arrFilter_303_712726050=Y',
            'Под песок': '&arrFilter_303_556679403=Y',
            'Под ткань': '&arrFilter_303_3209352520=Y',
            'Под травертин': '&arrFilter_303_3360548318=Y',
            'С бабочками': '&arrFilter_303_641959154=Y',
            'С дельфинами': '&arrFilter_303_3273192215=Y',
            'С животными': '&arrFilter_303_3070007651=Y',
            'С кофе': '&arrFilter_303_526855136=Y',
            'С текстом': '&arrFilter_303_426305210=Y',
            'С фруктами и едой': '&arrFilter_303_1852823084=Y',
            'С цветами': '&arrFilter_303_3657679446=Y',
            'Соль-перец': '&arrFilter_303_3585724252=Y',
            'Состаренная (рустик)': '&arrFilter_303_3766488758=Y',
            'Стекло': '&arrFilter_303_4027270031=Y',
            'Фотоплитка': '&arrFilter_303_2265740057=Y'
        },
        'text': 'Выберите рисунок плитки:',
        'next_step': 'Стиль плитки'
    },
    # Добавление "Стиль" для плитки

    'Стиль плитки': {
        'options': {
            'Авангардный': '&arrFilter_304_2257175159=Y',
            'Английский': '&arrFilter_304_3814766109=Y',
            'Античный': '&arrFilter_304_2227895265=Y',
            'Арабский': '&arrFilter_304_1062778291=Y',
            'Арт деко': '&arrFilter_304_2705072144=Y',
            'Барокко': '&arrFilter_304_2373760970=Y',
            'Восточный': '&arrFilter_304_343271024=Y',
            'Греческий': '&arrFilter_304_3089568081=Y',
            'Деревенский': '&arrFilter_304_2790384649=Y',
            'Детский': '&arrFilter_304_3939957302=Y',
            'Кантри': '&arrFilter_304_1328693564=Y',
            'Классический': '&arrFilter_304_4246094661=Y',
            'Кэжуал': '&arrFilter_304_2316399571=Y',
            'Лофт': '&arrFilter_304_1679758079=Y',
            'Майолика': '&arrFilter_304_2951194658=Y',
            'Марокканский': '&arrFilter_304_3474989511=Y',
            'Метлахский': '&arrFilter_304_4052677345=Y',
            'Модерн': '&arrFilter_304_2647771808=Y',
            'Морской': '&arrFilter_304_4202399580=Y',
            'Прованс': '&arrFilter_304_1668470502=Y',
            'Пэчворк': '&arrFilter_304_320348777=Y',
            'Ретро': '&arrFilter_304_225367857=Y',
            'Романтизм': '&arrFilter_304_2489812619=Y',
            'Рустика': '&arrFilter_304_943026602=Y',
            'Рыбья чешуя': '&arrFilter_304_2258700083=Y',
            'С капиносом': '&arrFilter_304_966264192=Y',
            'Скандинавский': '&arrFilter_304_4090350455=Y',
            'Современный': '&arrFilter_304_2053760935=Y',
            'Средиземноморский': '&arrFilter_304_3594195078=Y',
            'Хай-тек': '&arrFilter_304_3638597812=Y',
            'Японский': '&arrFilter_304_1214219557=Y'
        },
        'text': 'Выберите стиль плитки:',
        'next_step': 'Форма плитки'
    },

    # Добавление "Форма" для плитки
    'Форма плитки': {
        'options': {
            'Квадрат': '&arrFilter_322_3448021116=Y',
            'Круг': '&arrFilter_322_254668455=Y',
            'Многоугольник': '&arrFilter_322_32925333=Y',
            'Нестандартная': '&arrFilter_322_1863180143=Y',
            'Овал': '&arrFilter_322_110862988=Y',
            'Прямоугольник': '&arrFilter_322_708611451=Y',
            'Ромб': '&arrFilter_322_1906086426=Y',
            'Треугольник': '&arrFilter_322_2016075313=Y',
            'Шестиугольник (гексагон)': '&arrFilter_322_3680651118=Y'
        },
        'text': 'Выберите форму плитки:',
        'next_step': 'Цена'
    },

    # Добавление "Цена" для плитки
    'Цена': {
        'options': {
            'До 1000 рублей': '&arrFilter_P1_MAX=1000',
            '1000-2000 рублей': '&arrFilter_P1_MIN=1000&arrFilter_P1_MAX=2000',
            '2000-4000 рублей': '&arrFilter_P1_MIN=2000&arrFilter_P1_MAX=4000',
            '4000-8000 рублей': '&arrFilter_P1_MIN=4000&arrFilter_P1_MAX=8000',
            'Более 8000 рублей': '&arrFilter_P1_MIN=8000',
        },
        'text': 'Выберите диапазон цены:',
        'next_step': None  # Это последний шаг
    }
}

# Категории для сантехники
santechnika_categories = {
    # Новая категория "Тип сантехники"
    'Тип сантехники': {
        'options': {
            'Биде': '/bide?',
            'Ванны': '/vanny?',
            'Душевые гарнитуры': '/dushevye-garnitury?',
            'Душевые кабины': '/dushevye-kabiny?',
            'Инсталляции': '/installyatsii?',
            'Кухонные мойки': '/kukhonnye-moyki?',
            'Мебель для ванной': '/mebel-dlya-vannoy?',
            'Минибассейн': '/minibasseyn?',
            'Полотенцесушители': '/polotentsesushiteli?',
            'Писсуары': '/pissuary?',
            'Раковины': '/rakoviny?',
            'Смесители': '/smesiteli?',
            'Теплый пол': '/teplyy-pol?',
            'Унитазы': '/unitazy?',
        },
        'text': 'Выберите тип сантехники:',
        'next_step': 'Страна'
    },

    # Добавление "Страна"
    'Страна': {
        'options': {
            'Беларусь': '&arrFilter_140_2375093204=Y',
            'Бельгия': '&arrFilter_140_2468206053=Y',
            'Германия': '&arrFilter_140_3896922408=Y',
            'Индия': '&arrFilter_140_1965920576=Y',
            'Испания': '&arrFilter_140_1445694249=Y',
            'Италия': '&arrFilter_140_3887157092=Y',
            'Китай': '&arrFilter_140_879558018=Y',
            'Польша': '&arrFilter_140_12418911=Y',
            'Россия': '&arrFilter_140_2964086847=Y',
            'Турция': '&arrFilter_140_3425387233=Y',
            'Финляндия': '&arrFilter_140_3068239542=Y',
            'Франция': '&arrFilter_140_2846225438=Y',
            'Чехия': '&arrFilter_140_3763835575=Y',
            'Швейцария': '&arrFilter_140_336657189=Y',
            'Швеция': '&arrFilter_140_3472699297=Y'
        },
        'text': 'Выберите страну изготовления:',
        'next_step': 'Цвет сантехники'
    },

    # Добавление "Цвет сантехники"
    'Цвет сантехники': {
        'options': {
            'Бежевый': '&arrFilter_143_3864224617=Y',
            'Белый': '&arrFilter_143_536962777=Y',
            'Бронза': '&arrFilter_143_3377761499=Y',
            'Голубой': '&arrFilter_143_2395216905=Y',
            'Желтый': '&arrFilter_143_1024419739=Y',
            'Зеленый': '&arrFilter_143_900320306=Y',
            'Золото': '&arrFilter_143_1089212040=Y',
            'Коричневый': '&arrFilter_143_2751284698=Y',
            'Красный': '&arrFilter_143_2731415679=Y',
            'Медь': '&arrFilter_143_425785974=Y',
            'Прозрачный': '&arrFilter_143_189596016=Y',
            'Розовый': '&arrFilter_143_182554686=Y',
            'Салатовый': '&arrFilter_143_164984378=Y',
            'Сатин': '&arrFilter_143_2727966795=Y',
            'Серебро': '&arrFilter_143_2253544626=Y',
            'Серый': '&arrFilter_143_329120825=Y',
            'Синий': '&arrFilter_143_2117471943=Y',
            'Фиолетовый': '&arrFilter_143_1625973716=Y',
            'Хром': '&arrFilter_143_3025369759=Y',
            'Черно-белый': '&arrFilter_143_3977827759=Y',
            'Черный': '&arrFilter_143_1510538883=Y'
        },
        'text': 'Выберите цвет сантехники:',
        'next_step': 'Поверхность сантехники'
    },

    # заполни справочник Поверхность сантехники:
    'Поверхность сантехники': {
        'options': {
            'Глянцевая': '&arrFilter_144_2994474102=Y',
            'Матовая': '&arrFilter_144_135514243=Y',
            'Рельефная': '&arrFilter_144_2776233212=Y',
            'Сатиновая': '&arrFilter_144_4137434175=Y'
        },
        'text': 'Выберите поверхность сантехники:',
        'next_step': 'Форма сантехники'
    },

    # заполни справочник Форма сантехники:
    'Форма сантехники': {
        'options': {
            'Ассиметричная': '&arrFilter_147_2055840643=Y',
            'Квадратная': '&arrFilter_147_1945736123=Y',
            'Круглая': '&arrFilter_147_1619331039=Y',
            'Многоугольная': '&arrFilter_147_190109084=Y',
            'Нестандартная': '&arrFilter_147_1546690559=Y',
            'Овальная': '&arrFilter_147_334483910=Y',
            'Округлая': '&arrFilter_147_2647207081=Y',
            'Полукруглая': '&arrFilter_147_1604187309=Y',
            'Прямоугольная': '&arrFilter_147_819774201=Y',
            'Трапеция': '&arrFilter_147_3751074424=Y'
        },
        'text': 'Выберите форму сантехники:',
        'next_step': 'Материал сантехники'
    },

    # заполни справочник Материал сантехники:
    'Материал сантехники': {
        'options': {
            'Гранит': '&arrFilter_153_462907835=Y',
            'Дерево': '&arrFilter_153_3599938694=Y',
            'Искусственный гранит': '&arrFilter_153_3284639516=Y',
            'Искусственный камень': '&arrFilter_153_1876608044=Y',
            'Искусственный кварц': '&arrFilter_153_107851516=Y',
            'Искусственный мрамор': '&arrFilter_153_2279366644=Y',
            'Кварцевый композит': '&arrFilter_153_2449656423=Y',
            'Керамика': '&arrFilter_153_3686373445=Y',
            'Композит': '&arrFilter_153_2644201428=Y',
            'Латунь': '&arrFilter_153_2815405401=Y',
            'Литой мрамор': '&arrFilter_153_145172204=Y',
            'Медь': '&arrFilter_153_425785974=Y',
            'Минеральное литье': '&arrFilter_153_309359346=Y',
            'Мрамор': '&arrFilter_153_1603053907=Y',
            'Нержавеющая сталь': '&arrFilter_153_2815100860=Y',
            'Сталь': '&arrFilter_153_200375247=Y',
            'Стекло': '&arrFilter_153_2437788616=Y'
        },
        'text': 'Выберите материал сантехники:',
        'next_step': 'Цена сантехники'
    },

    # Добавление "Цена сантехники"
    'Цена сантехники': {
        'options': {
            'До 3.000 рублей': '&arrFilter_P1_MAX=3000',
            '3.000-10.000 рублей': '&arrFilter_P1_MIN=3000&arrFilter_P1_MAX=10000',
            '10.000-30.000 рублей': '&arrFilter_P1_MIN=10000&arrFilter_P1_MAX=30000',
            '30.000-70.000 рублей': '&arrFilter_P1_MIN=30000&arrFilter_P1_MAX=70000',
            '70.000-120.000 рублей': '&arrFilter_P1_MIN=70000&arrFilter_P1_MAX=120000',
            'Более 120.000 рублей': '&arrFilter_P1_MIN=120000'
        },
        'text': 'Выберите диапазон цены сантехники:',
        'next_step': None  # Это последний шаг
    }
}

# Категории для напольных покрытий
floor_categories = {
    # Новая категория "Тип покрытия"
    'Тип покрытия': {
        'options': {
            'Виниловая плитка': '&arrFilter_95_1593289528=Y',
            'Инженерная доска': '&arrFilter_95_1314246576=Y',
            'Ламинат': '&arrFilter_95_2969160212=Y',
            'Массивная доска': '&arrFilter_95_2927634094=Y',
            'Паркетная доска': '&arrFilter_95_3649508920=Y',
            'Пробковый паркет': '&arrFilter_95_3271082569=Y',
            'Террасная доска': '&arrFilter_95_3414912294=Y',
            'Штучный паркет': '&arrFilter_95_2122381264=Y'
        },
        'text': 'Выберите тип напольного покрытия:',
        'next_step': 'Оттенок покрытия'
    },
    # Добавление "Оттенок покрытия"
    'Оттенок покрытия': {
        'options': {
        'Бежево-коричневый': '&arrFilter_96_449870554=Y',
        'Бежево-розовый': '&arrFilter_96_1161987567=Y',
        'Бежево-серый': '&arrFilter_96_3810435717=Y',
        'Бежевый': '&arrFilter_96_3157954722=Y',
        'Белый': '&arrFilter_96_3409813556=Y',
        'Выбеленный': '&arrFilter_96_219202473=Y',
        'Голубой': '&arrFilter_96_3786863877=Y',
        'Желто-коричневый': '&arrFilter_96_1379201422=Y',
        'Желтый': '&arrFilter_96_1720388977=Y',
        'Зеленый': '&arrFilter_96_1608591566=Y',
        'Коричневый': '&arrFilter_96_624148760=Y',
        'Красно-коричневый': '&arrFilter_96_2484703763=Y',
        'Мультиколор': '&arrFilter_96_1146244623=Y',
        'Оранжевый': '&arrFilter_96_1973593205=Y',
        'Розовый': '&arrFilter_96_294403559=Y',
        'Светло-коричневый': '&arrFilter_96_944465202=Y',
        'Светло-серый': '&arrFilter_96_2322556747=Y',
        'Серый': '&arrFilter_96_1930234459=Y',
        'Темно-коричневый': '&arrFilter_96_2788159633=Y',
        'Темно-серый': '&arrFilter_96_3594847262=Y',
        'Черный': '&arrFilter_96_1824101684=Y'
        },
        'text': 'Выберите оттенок покрытия:',
        'next_step': 'Цена покрытия'
    },
    # Добавление "Цена покрытия"
    'Цена покрытия': {
        'options': {
            'До 1000 рублей': '&arrFilter_P1_MAX=1000',
            '1000-2000 рублей': '&arrFilter_P1_MIN=1000&arrFilter_P1_MAX=2000',
            '2000-4000 рублей': '&arrFilter_P1_MIN=2000&arrFilter_P1_MAX=4000',
            '4000-8000 рублей': '&arrFilter_P1_MIN=4000&arrFilter_P1_MAX=8000',
            'Более 8000 рублей': '&arrFilter_P1_MIN=8000'
        },
        'text': 'Выберите диапазон цены напольного покрытия:',
        'next_step': None  # Это последний шаг
    }
}
