categories = {
    # Категория "Назначение" для плитки
    'Назначение': {
        'options': {
            'Для ванной': '&arrFilter_45_2367533627=Y',
            'Керамогранит': '&arrFilter_45_2225864208=Y',
            'Мозаика': '&arrFilter_45_336913281=Y',
            'Настенная плитка': '&arrFilter_45_326707096=Y',
            'Напольная плитка': '&arrFilter_45_1662243607=Y',
            'Для кухни': '&arrFilter_45_4196041389=Y',
            'Ступени (клинкер)': '&arrFilter_45_4088188550=Y'
        },
        'text': 'Выберите назначение плитки:',
        'next_step': 'Цвет'
    },
    # Категория "Цвет" для плитки
    'Цвет': {
        'options': {
            'Белый': '&arrFilter_44_734540143=Y',
            'Бежевый': '&arrFilter_44_1557070329=Y',
            'Желтый': '&arrFilter_44_1161005205=Y',
            'Голубой': '&arrFilter_44_895056922=Y',
            'Красный': '&arrFilter_44_3694844207=Y',
            'Розовый': '&arrFilter_44_842315779=Y',
            'Зеленый': '&arrFilter_44_1113476236=Y',
            'Коричневый': '&arrFilter_44_3429899368=Y',
            'Мультиколор': '&arrFilter_44_3795085693=Y',
            'Оранжевый': '&arrFilter_44_3145149694=Y',
            'Серый': '&arrFilter_44_3679919414=Y',
            'Синий': '&arrFilter_44_2890935712=Y',
            'Фиолетовый': '&arrFilter_44_2872961465=Y',
            'Черно-белый': '&arrFilter_44_2651089905=Y',
            'Черный': '&arrFilter_44_1273495719=Y',
        },
        'text': 'Выберите цвет плитки:',
        'next_step': 'Поверхность'  # Переход к следующему шагу - выбор поверхности
    },
    # Добавление "Поверхность" для плитки
    'Поверхность': {
        'options': {
            '3D - объемная': '&arrFilter_46_1124766700=Y',
            'Глянцевая': '&arrFilter_46_2999017685=Y',
            'Лаппатированная': '&arrFilter_46_136430004=Y',
            'Матовая': '&arrFilter_46_3318108227=Y',
            'Металлизированная': '&arrFilter_46_2041144555=Y',
            'Полированная': '&arrFilter_46_600644105=Y',
            'Противоскользящая': '&arrFilter_46_256640429=Y',
            'Рельефная': '&arrFilter_46_1022308401=Y',
            'Сатинированная': '&arrFilter_46_2865420758=Y'
        },
        'text': 'Выберите поверхность плитки:',
        'next_step': 'Рисунок'
    },
    # Добавление "Рисунок" для плитки

    'Рисунок': {
        'options': {
            'Ёлочка': '&arrFilter_303_2466923154=Y',
            'Абстракция': '&arrFilter_303_777373087=Y',
            'Бабочка': '&arrFilter_303_1319056662=Y',
            'Брусчатка': '&arrFilter_303_2030862416=Y',
            'В клетку': '&arrFilter_303_1422535327=Y',
            'В полоску': '&arrFilter_303_1568433844=Y',
            'Волны': '&arrFilter_303_3133262972=Y',
            'Геометрия': '&arrFilter_303_687500209=Y',
            'Дизайн': '&arrFilter_303_163811428=Y',
            'Зеркальный': '&arrFilter_303_3522607083=Y',
            'Кракелюр': '&arrFilter_303_3826086404=Y',
            'Лофт': '&arrFilter_303_896538121=Y',
            'Металл': '&arrFilter_303_2544305607=Y',
            'Метлахский': '&arrFilter_303_2800846717=Y',
            'Моноколор': '&arrFilter_303_756453947=Y',
            'Мрамор': '&arrFilter_303_1742705075=Y',
            'Однотонная': '&arrFilter_303_313873987=Y',
            'Оригами': '&arrFilter_303_2693878842=Y',
            'Орнамент': '&arrFilter_303_1498608905=Y',
            'Под бетон': '&arrFilter_303_2902782656=Y',
            'Под гальку': '&arrFilter_303_167973672=Y',
            'Под гранит': '&arrFilter_303_4252118912=Y',
            'Под дерево': '&arrFilter_303_3010594712=Y',
            'Под камень': '&arrFilter_303_3021980545=Y',
            'Под кирпич': '&arrFilter_303_1147623413=Y',
            'Под ковер': '&arrFilter_303_1877632834=Y',
            'Под кожу': '&arrFilter_303_2435354638=Y',
            'Под ламинат': '&arrFilter_303_1445556349=Y',
            'Под металл': '&arrFilter_303_2757035718=Y',
            'Под мозаику': '&arrFilter_303_1511105197=Y',
            'Под мрамор': '&arrFilter_303_1139616705=Y',
            'Под обои': '&arrFilter_303_2917354221=Y',
            'Под оникс': '&arrFilter_303_2380059838=Y',
            'Под паркет': '&arrFilter_303_712726050=Y',
            'Под песок': '&arrFilter_303_556679403=Y',
            'Под ткань': '&arrFilter_303_3209352520=Y',
            'Под травертин': '&arrFilter_303_3360548318=Y',
            'С бабочками': '&arrFilter_303_641959154=Y',
            'С дельфинами': '&arrFilter_303_3273192215=Y',
            'С животными': '&arrFilter_303_3070007651=Y',
            'С кофе': '&arrFilter_303_526855136=Y',
            'С текстом': '&arrFilter_303_426305210=Y',
            'С фруктами и едой': '&arrFilter_303_1852823084=Y',
            'С цветами': '&arrFilter_303_3657679446=Y',
            'Соль-перец': '&arrFilter_303_3585724252=Y',
            'Состаренная (рустик)': '&arrFilter_303_3766488758=Y',
            'Стекло': '&arrFilter_303_4027270031=Y',
            'Фотоплитка': '&arrFilter_303_2265740057=Y'
        },
        'text': 'Выберите рисунок плитки:',
        'next_step': 'Стиль'
    },
    # Добавление "Стиль" для плитки

    'Стиль': {
        'options': {
            'Авангардный': '&arrFilter_304_2257175159=Y',
            'Английский': '&arrFilter_304_3814766109=Y',
            'Античный': '&arrFilter_304_2227895265=Y',
            'Арабский': '&arrFilter_304_1062778291=Y',
            'Арт деко': '&arrFilter_304_2705072144=Y',
            'Барокко': '&arrFilter_304_2373760970=Y',
            'Восточный': '&arrFilter_304_343271024=Y',
            'Греческий': '&arrFilter_304_3089568081=Y',
            'Деревенский': '&arrFilter_304_2790384649=Y',
            'Детский': '&arrFilter_304_3939957302=Y',
            'Кантри': '&arrFilter_304_1328693564=Y',
            'Классический': '&arrFilter_304_4246094661=Y',
            'Кэжуал': '&arrFilter_304_2316399571=Y',
            'Лофт': '&arrFilter_304_1679758079=Y',
            'Майолика': '&arrFilter_304_2951194658=Y',
            'Марокканский': '&arrFilter_304_3474989511=Y',
            'Метлахский': '&arrFilter_304_4052677345=Y',
            'Модерн': '&arrFilter_304_2647771808=Y',
            'Морской': '&arrFilter_304_4202399580=Y',
            'Прованс': '&arrFilter_304_1668470502=Y',
            'Пэчворк': '&arrFilter_304_320348777=Y',
            'Ретро': '&arrFilter_304_225367857=Y',
            'Романтизм': '&arrFilter_304_2489812619=Y',
            'Рустика': '&arrFilter_304_943026602=Y',
            'Рыбья чешуя': '&arrFilter_304_2258700083=Y',
            'С капиносом': '&arrFilter_304_966264192=Y',
            'Скандинавский': '&arrFilter_304_4090350455=Y',
            'Современный': '&arrFilter_304_2053760935=Y',
            'Средиземноморский': '&arrFilter_304_3594195078=Y',
            'Хай-тек': '&arrFilter_304_3638597812=Y',
            'Японский': '&arrFilter_304_1214219557=Y'
        },
        'text': 'Выберите стиль плитки:',
        'next_step': 'Форма'
    },

    # Добавление "Форма" для плитки
    'Форма': {
        'options': {
            'Квадрат': '&arrFilter_322_3448021116=Y',
            'Круг': '&arrFilter_322_254668455=Y',
            'Многоугольник': '&arrFilter_322_32925333=Y',
            'Нестандартная': '&arrFilter_322_1863180143=Y',
            'Овал': '&arrFilter_322_110862988=Y',
            'Прямоугольник': '&arrFilter_322_708611451=Y',
            'Ромб': '&arrFilter_322_1906086426=Y',
            'Треугольник': '&arrFilter_322_2016075313=Y',
            'Шестиугольник (гексагон)': '&arrFilter_322_3680651118=Y'
        },
        'text': 'Выберите форму плитки:',
        'next_step': 'Цена'
    },

    # Добавление "Цена" для плитки
    'Цена': {
        'options': {
            'До 1000 рублей': '&arrFilter_P1_MAX=1000',
            '1000-2000 рублей': '&arrFilter_P1_MIN=1000&arrFilter_P1_MAX=2000',
            '2000-4000 рублей': '&arrFilter_P1_MIN=2000&arrFilter_P1_MAX=4000',
            '4000-8000 рублей': '&arrFilter_P1_MIN=4000&arrFilter_P1_MAX=8000',
            'Более 8000 рублей': '&arrFilter_P1_MIN=8000',
        },
        'text': 'Выберите диапазон цены:',
        'next_step': None  # Это последний шаг
    },
    # Новая категория "Тип сантехники"
    'Тип сантехники': {
        'options': {
            'Биде': '/bide',
            'Ванны': '/vanny',
            'Душевые гарнитуры': '/dushevye-garnitury',
            'Душевые кабины': '/dushevye-kabiny',
            'Инсталляции': '/installyatsii',
            'Кухонные мойки': '/kukhonnye-moyki',
            'Мебель для ванной': '/mebel-dlya-vannoy',
            'Минибассейн': '/minibasseyn',
            'Полотенцесушители': '/polotentsesushiteli',
            'Писсуары': '/pissuary',
            'Раковины': '/rakoviny',
            'Смесители': '/smesiteli',
            'Теплый пол': '/teplyy-pol',
            'Унитазы': '/unitazy',
        },
        'text': 'Выберите тип сантехники:',
        'next_step': 'Бренд сантехники'
    },
    # Добавление "Бренд сантехники"
    'Бренд сантехники': {
        'options': {
            'Roca': '&arrFilter_52_3420982455=Y',
            'Grohe': '&arrFilter_52_1320975589=Y',
            'Hansgrohe': '&arrFilter_52_278352087=Y',
            'Villeroy & Boch': '&arrFilter_52_2898127547=Y',
        },
        'text': 'Выберите бренд сантехники:',
        'next_step': 'Цена сантехники'
    },
    # Добавление "Цена сантехники"
    'Цена сантехники': {
        'options': {
            'До 5000 рублей': '&price=low',
            '5000-10000 рублей': '&price=medium',
            'Более 10000 рублей': '&price=high',
        },
        'text': 'Выберите диапазон цены сантехники:',
        'next_step': None  # Это последний шаг
    },
    # Новая категория "Тип покрытия"
    'Тип покрытия': {
        'options': {
            'Ламинат': '&arrFilter_53_213090400=Y',
            'Паркетная доска': '&arrFilter_53_4089585740=Y',
            'Ковролин': '&arrFilter_53_136758936=Y',
            'Виниловая плитка': '&arrFilter_53_273526781=Y',
            'Линолеум': '&arrFilter_53_378617391=Y',
        },
        'text': 'Выберите тип напольного покрытия:',
        'next_step': 'Цвет покрытия'
    },
    # Добавление "Цвет покрытия"
    'Цвет покрытия': {
        'options': {
            'Светлый': '&arrFilter_54_123349847=Y',
            'Темный': '&arrFilter_54_834960847=Y',
            'Серый': '&arrFilter_54_2323418937=Y',
            'Деревянный оттенок': '&arrFilter_54_121432134=Y',
        },
        'text': 'Выберите цвет покрытия:',
        'next_step': 'Цена покрытия'
    },
    # Добавление "Цена покрытия"
    'Цена покрытия': {
        'options': {
            'До 500 рублей': '&price=low',
            '500-1000 рублей': '&price=medium',
            'Более 1000 рублей': '&price=high',
        },
        'text': 'Выберите диапазон цены напольного покрытия:',
        'next_step': None  # Это последний шаг
    }
}